# SetLayerModifiers Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..SetLayerModifiers Method
ExportLayerInfo Class See Also
---
Sets a project layer modifier array to the layer info.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetLayerModifiers(
	IList<LayerModifier> layermodifiers
)
```

Visual Basic
---
```text
Public Sub SetLayerModifiers ( _
	layermodifiers As IList(Of LayerModifier) _
)
```

Visual C++
---
```text
public:
void SetLayerModifiers(
	IList<LayerModifier^>^ layermodifiers
)
```

# ### Parameters
layermodifiers
    Type: System.Collections.Generic..::..IList<(Of <(<'LayerModifier>)>)> The project layer modifier array.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace